title: Net commands
id:
status: experimental
description: Detects recon using net.exe commands
references:
    - https://
author: Luk Schoonaert (CrimsonCORE)
date: 2020/03/22
tags:
    - attack.
    - attack.t
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        OriginalFileName:
            - '*net.exe'
            - '*net1.exe'
    condition: selection
falsepositives:
    - Very likely, needs more tuning
level: high